# Parameters
nc: 27 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-ghost summary: 403 layers,  1865316 parameters,  1865300 gradients,   5.8 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s-ghost summary: 403 layers,  5960072 parameters,  5960056 gradients,  16.4 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m-ghost summary: 603 layers, 10336312 parameters, 10336296 gradients,  32.7 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l-ghost summary: 803 layers, 14277872 parameters, 14277856 gradients,  53.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x-ghost summary: 803 layers, 22229308 parameters, 22229292 gradients,  83.3 GFLOPs

# Parameters
nc: 27 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-ghost summary: 403 layers,  1865316 parameters,  1865300 gradients,   5.8 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s-ghost summary: 403 layers,  5960072 parameters,  5960056 gradients,  16.4 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m-ghost summary: 603 layers, 10336312 parameters, 10336296 gradients,  32.7 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l-ghost summary: 803 layers, 14277872 parameters, 14277856 gradients,  53.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x-ghost summary: 803 layers, 22229308 parameters, 22229292 gradients,  83.3 GFLOPs

# YOLOv8.0n-ghost backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # First Conv layer
  - [-1, 1, GhostConv, [128, 3, 2]] # GhostConv layer
  - [-1, 3, C2f, [128, True]] # C2f layer
  - [-1, 1, GhostConv, [256, 3, 2]] # GhostConv layer
  - [-1, 6, C2f, [256, True]] # C2f layer
  - [-1, 1, GhostConv, [512, 3, 2]] # GhostConv layer
  - [-1, 6, C2f, [512, True]] # C2f layer
  - [-1, 1, GhostConv, [1024, 3, 2]] # GhostConv layer
  - [-1, 3, C2f, [1024, True]] # C2f layer
  - [-1, 1, SPPF, [1024, 5]] # SPPF layer

# YOLOv8.0n head
head:
  - [[2, 4, 6, 9], 1, SimFusion_4in, []] # 10
  - [-1, 1, IFM, [[64, 32]]] # 11
   
  - [6, 1, Conv, [256, 1, 1]] # 12
  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 13
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 14
  - [-1, 3, C2f, [256]] # 15

  - [[15], 1, Detect, [nc]] # 16
